Tekla Open API Reference for Tekla Structures 2025
PreferredTextPlacingTypes Class
 The PreferredTextPlacingTypes class contains the available preferred text placing types. These are allowed to be used for texts.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredTextPlacingTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class PreferredTextPlacingTypes
Public NotInheritable Class PreferredTextPlacingTypes
The PreferredTextPlacingTypes type exposes the following members.
Methods
Name | Description
AlongLinePlacingType
 The object is placed using the along line placing.
BaseLinePlacingType
 The object is placed using the base line placing.
BaseLineWithArrowAtEndPointPlacingType
 The object is placed using the base line placing. The line is drawn and will have an arrow at the end point.
BaseLineWithArrowAtStartPointPlacingType
 The object is placed using the base line placing. The line is drawn and will have an arrow at the start point.
LeaderLinePlacingType
 The object is placed with a leader line.
PointPlacingType
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace